CNRS-Optimized-Reactor-CFD/case3/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

x0		        0.0;
x_pos		0.002;
x_neg		#calc "-1*$x_pos";

y_0		          0.0;	
y_added           0.1;
y_length_real   1.0;
y_length	#calc "$y_length_real + $y_added ";

z_0		0.0;
z_length	1.0;

vertices
(
    ($x_neg 	$y_0 		$z_0)  		//0
    ($x_pos 	$y_0 		$z_0)  		//1
    ($x_pos 	$y_length 	$z_0)  		//2
    ($x_neg 	$y_length 	$z_0)  		//3
    ($x_neg 	$y_0 		$z_length)  //4
    ($x_pos 	$y_0 		$z_length)  //5
    ($x_pos 	$y_length 	$z_length)  //6
    ($x_neg 	$y_length 	$z_length)  //7
);

nx	1;
nn	#calc  "($y_length_real/$z_length)";
ny	40;   		     
nz 	#calc  "int($ny/$nn)";  
	
blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    rightWall
    {
        type  wall;
        faces
        (
            (3 7 6 2)
        );
    }
    
    leftWall
    {
        type  wall;
        faces
        (
            (1 5 4 0)
        );
    }
    
    top
    {
        type  patch;
        faces
        (
            (0 3 2 1)
        );
    }
    
    bottom
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
        );
    }
);

// ************************************************************************* //
