CNRS-Optimized-Reactor-CFD/case3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          30;
        startFace       1740;
    }
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          30;
        startFace       1770;
    }
    top
    {
        type            patch;
        nFaces          30;
        startFace       1800;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          30;
        startFace       1830;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1800;
        startFace       1860;
    }
)

// ************************************************************************* //
