CNRS-Optimized-Reactor-CFD/case3/constant/box/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation               on;

radiationModel    fvDOM;

fvDOMCoeffs
{
    nPhi            16; 
    nTheta        32;
    maxIter      10;
    tolerance   1e-3;
}
solverFreq 10;

absorptionEmissionModel constantAbsorptionEmission;

constantAbsorptionEmissionCoeffs
{
   absorptivity    absorptivity    [ m^-1 ]                 0.0; 
   emissivity        emissivity        [ m^-1 ]                0.0; 
   E                        E                       [ kg m^-1 s^-3 ]   0.0;
}

scatterModel    none;

sootModel       none;
// ************************************************************************* //
