CNRS-Optimized-Reactor-CFD/case3/constant/box/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//air
thermoType
{
    type                         heRhoThermo;
    mixture                   pureMixture;
    transport                const;
    thermo                    hConst;
    equationOfState   perfectGas;
    specie                      specie;
    energy                     sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight       28.9;
    }
    thermodynamics
    {
        Cp              1000;
        Hf               0;
    }
    transport
    {
        mu              1.8e-05;
        Pr                 0.7;
    }
}
// ************************************************************************* //
