CNRS-Optimized-Reactor-CFD/case3/system/box/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class         dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default            cellLimited Gauss linear 0.95; 

    pressure          Gauss linear;    
    grad(p)             $pressure;
    grad(p_rgh)     $pressure;    
}

divSchemes
{
    default         none;   

    div(phi,U)      bounded Gauss linearUpwindV grad(U); 

    energy          Gauss upwind; 
    div(phi,K)      $energy;
    div(phi,h)      $energy;

    turbulence              Gauss upwind;
    div(phi,k)                 $turbulence;
    div(phi,epsilon)      $turbulence;
    div(phi,R)                 $turbulence;

    div(R)                        Gauss linear;
    div(Ji,Ii_h)                 Gauss linearUpwind grad(U);
    div(((rho*nuEff)*dev2(T(grad(U)))))    Gauss linear;
}

laplacianSchemes
{
    default                     Gauss linear limited 0.3;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 0.3;
}

wallDist
{
    method meshWave;
}
// ************************************************************************* //
