CNRS-Optimized-Reactor-CFD/case3/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvConstraints;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
	limitT
	{
	    type       limitTemperature;
	    min        290;
	    max       1200;
	    selectionMode all;
	}

// ************************************************************************* //

