CNRS-Optimized-Reactor-CFD/case3/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
x_pos     0.002;
xmax      $x_pos;
xmin      #calc "(-1*$x_pos )";

ymin       0;
ymax      1;

zmin        0;
zmax       1;

actions
(
    {
        name        box;
        type          cellSet;
        action       new;
        source      boxToCell;
        sourceInfo
        {
            box ($xmin $ymin $zmin) ($xmax $ymax $zmax);
        }
    }
    
    {
        name      box;
        type         cellZoneSet;
        action      new;
        source     setToCellZone;
        sourceInfo
        {
              set       box;
        }
    }  
     
);

// ************************************************************************* //
